Repository: celebiFatih/qr-coder
Catalog: lib/l10n/app_*.arb
Languages: tr

# language
source: EN
tr: TR

# login_WelcomeText
source: Welcome to QR Coder!
tr: QR Coder'a Hoşgeldiniz!

# login_DescriptionText
source: Please enter your email and password to continue.
tr: Devam etmek için e-posta ve şifrenizi girin.

# login_label_email
source: Email
tr: E-posta

# login_label_password
source: Password
tr: Parola

# login_hint_email
source: Enter your email
tr: E-postanızı girin

# login_hint_password
source: Enter your password
tr: Parolanızı girin

# login_LoginOrRegisterToggle
source: Don't have an account?
tr: Hesabın yok mu?

# login_LoginOrRegisterToggleAlreadyHaveAccount
source: Already have an account.
tr: Zaten hesabım var.

# login_GuestAccessButton
source: Continue without an account
tr: Kaydolmadan devam et

# login_RememberMeCheckbox
source: Remember me
tr: Beni hatırla

# login_SubmitButtonLogIn
source: Sign in
tr: Giriş yap

# login_SubmitButtonRegister
source: Register
tr: Kaydol

# login_ForgotPasswordButton
source: Forgot password
tr: Şifremi unuttum

# login_emailValidatorError
source: Please enter a valid email
tr: Lütfen geçerli bir e-posta girin

# login_emailValidator
source: Please enter an email
tr: Lütfen bir e-posta girin

# login_passwordValidator
source: Please enter a password
tr: Lütfen şifre girin

# login_passwordValidatorError
source: Password must be at least 6 characters long
tr: Şifre en az 6 karakter uzunluğunda olmalı

# login_emailAlreadyRegistered
source: This email is already registered!
tr: Bu e-posta zaten kayıtlı!

# login_emailNotVerifiedMsg
source: Email verification not completed. Please check your email.
tr: E-posta doğrulaması yapılmadı. Lütfen e-postanızı kontrol edin.

# login_createUserErrorMsg
source: Failed to create user!
tr: Kullanıcı kaydı oluşturulamadı!

# login_signInErrorMsg
source: Failed to sign in!
tr: Giriş yapılamadı!

# login_signInSuccessMsg
source: Sign in successful!
tr: Giriş yapıldı!

# login_invalidCredentialsErrMsg
source: User not found!
tr: Kullanıcı kaydı bulunamadı!

# qrCodeGenerator_FabSemantic
source: QR Code Generator Button
tr: QR Kodu oluşturma butonu

# qrCodeGenerator_FabToolTip
source: Generate QR Code
tr: QR Code Oluştur

# qrCodeGenerator_LogOutToolTip
source: Log Out
tr: Oturumu Sonlandır

# qrCodeGenerator_LogOutErrorMsg
source: Failed to log out!
tr: Oturum kapatılamadı!

# qrCodeGenerator_userType
source: Guest
tr: Misafir

# qrCodeGenerator_textSemantic
source: Text field for entering data to be encoded
tr: QR kodu oluşturmaya yönelik verileri girmek için metin alanı

# qrCodeGenerator_qrCodeSemantic
source: QR Code Preview
tr: QR kodu görüntüsü

# qrCodeGenerator_receiveErrorMsg
source: Failed to receive data!
tr: Veri alınamadı!

# qrCodeGenerator_sharedData
source: Shared data
tr: Paylaşılan veri

# qrCodeGenerator_savePermissionErrorMsg
source: Storage permission required!
tr: Depolama izni gerekli!

# qrCodeGenerator_saveErrorMsg
source: Failed to save QR Code!
tr: QR kodu kaydetme hatası!

# qrCodeGenerator_saveToDbErrorMsg
source: Failed to save QR Code to database!
tr: QR kod veritabanına kaydedilemedi!

# qrCodeGenerator_sharedTitle
source: Here is your QR Code
tr: İşte QR kodunuz

# qrCodeGenerator_sharedErrorMsg
source: Failed to share QR Code!
tr: QR kodu paylaşılamadı!

# qrCodeGenerator_dataEmptyMsg
source: Please enter some text to generate a QR Code!
tr: QR kod oluşturmak için bir metin girin!

# qrCodeGenerator_qrCodeDefaultTitle
source: QR Code
tr: QR Kod

# qrCodeGenerator_qrCodeGeneratorErrMsg
source: Failed to generate QR Code!
tr: QR kod oluşturma hataası!

# qrCodeGenerator_startScanningToolTip
source: Start Barcode Scanner
tr: Tarayıcıyı Başlat

# qrcodeGenerator_qrCodeListToolTip
source: Saved QR Codes
tr: Son Kaydedilenler

# qrCodeGenerator_textFieldHintText
source: Enter some text to generate a QR Code
tr: QR kod oluşturulacak metni girin

# qrCodeGenerator_dataTooLongErrMsg
source: Text is too long!
tr: Metin çok uzun!

# qrCodeGenerator_qrCode
source: QR Code
tr: QR Kod

# qrCodeList_title
source: Saved QR Codes
tr: Son Oluşturulanlar

# qrCodeList_deleteAllBtn
source: Delete All
tr: Tümünü Sil

# qrCodeList_selectAllBtn
source: Select All
tr: Tümünü Seç

# qrCodeList_deleteSelectedBtn
source: Delete Selected
tr: Seçilenleri Sil

# qrCodeList_editBtn
source: Edit
tr: Düzenle

# qrCodeList_defaultQrCode
source: Welcome to QR Coder!
tr: QR Coder'a Hoşgeldiniz!

# qrCodeList_fetchListErrorMsg
source: Failed to fetch QR Code list!
tr: QR Kod listesi alınamadı!

# qrCodeList_emptyList
source: QR Code list is empty...
tr: QR Kod listesi boş...

# qrCodeList_updateDescriptionErrorMsg
source: Failed to update QR Code description!
tr: QR Kod tanımlaması güncellenemedi!

# qrCodeList_deleteAllErrorMsg
source: Failed to delete all QR Codes!
tr: Tüm QR Kodlar silinemedi!

# qrCodeList_deleteErrorMsg
source: Failed to delete QR Code!
tr: QR Kod silinemedi!

# qrCodeList_qrCodeTitle
source: QR Code: {qrCode}
tr: QR Kod: {qrCode}

# qrCodeDetail_Details
source: Details
tr: Detaylar

# qrCodeDetail_wifiInfo
source: Wi-Fi Information
tr: Wi-Fi Bilgileri

# qrCodeDetail_wifiPassw
source: Password: {password}
tr: Şifre: {password}

# qrCodeDetail_wifiEncryption
source: Encryption: {encryption}
tr: Şifreleme: {encryption}

# qrCodeDetail_wifiHidden
source: Hidden: {hidden}
tr: Gizli: {hidden}

# qrCodeDetail_wifiConnectTextBtn
source: Connect
tr: Bağlan

# qrCodeDetail_OpenWifiSettingsButton
source: Open Wi-Fi Settings
tr: Wi-Fi ayarlarını aç

# qrCodeDetail_homePageNavToolTip
source: Home Page
tr: Ana Sayfa

# qrCodeDetail_listPageNavToolTip
source: Saved QR Codes
tr: Kaydedilenler

# qrCodeDetail_createdDateTime
source: Created At: {createdAt}
tr: Oluşturma Tarihi: {createdAt}

# qrCodeDetail_saveQrCodeButtonToolTip
source: Save QR Code
tr: QR kodu indir

# qrCodeDetail_saveSuccessMsg
source: QR Code saved successfully!
tr: QR kodu başarılı bir şekilde indirildi!

# qrCodeDetail_openSavedQrCode
source: Open
tr: Aç

# qrCodeDetail_shareQrCodeBtnToolTip
source: Share QR Code
tr: Paylaş

# qrCodeDetail_resolution
source: Resolution
tr: Çözünürlük

# qrCodeDetail_download
source: Download
tr: İndir

# qrCodeDetail_resolutionStandard
source: Standard Resolution
tr: Standart Çözünürlük

# qrCodeDetail_resolutionHigh
source: High Resolution
tr: Yüksek Çözünürlük

# qrCodeDetail_resolutionUltra
source: Ultra Resolution
tr: Ultra Çözünürlük

# verificationPage_description
source: Pending Verification. Please check your email.
tr: Doğrulama bekleniyor. Lütfen e-postanızı kontrol edin.

# verificationPage_emailVerifiedMsg
source: User verification completed! Welcome to QR Coder!
tr: Kullanıcı doğrulaması tamamlandı! QR Coder'a Hoşgeldiniz!

# verificationPage_emailVerificationErrorMsg
source: User verification failed!
tr: Kullanıcı doğrulaması tamamlanamadı!

# verificationPage_sendMailErrorMsg
source: Failed to send verification email! Please try again.
tr: Doğrulama e-postası gönderilemedi! Lütfen yeniden deneyin.

# verificationPage_verificationEmailResentMsg
source: Verification link sent again.
tr: Doğrulama bağlantısı tekrar gönderildi.

# verificationPage_sendAgainBtn
source: Send Again
tr: Yeniden gönderin

# verificationPage_welcomeTitle
source: Welcome to QR Coder!
tr: QR Coder'a Hoşgeldiniz!

# verificationPage_sendAgainMsg
source: New verification email sent. Please verify your account within 24 hours.
tr: Yeni bir doğrulama e-postası gönderildi. Lütfen 24 saat içinde doğrulayın.

# verificationPage_sendVerificationEmail
source: Verification email sent. Please check your email.
tr: Doğrulama e-postası gönderildi. Lütfen e-postanızı kontrol edin.

# forgotPasswordPage_description
source: Please enter your email to reset your password.
tr: Lütfen sıfırlama isteğiniz için e-posta adresinizi girin.

# forgotPasswordPage_emailValidatorError
source: Please enter a valid email
tr: Lütfen geçerli bir e-posta girin

# forgotPasswordPage_emailValidator
source: Please enter an email
tr: Lütfen bir e-posta girin

# forgotPasswordPage_textFieldLabelText
source: Email
tr: E-posta

# forgotPasswordPage_textFieldHintText
source: Enter your email
tr: E-postanızı girin

# forgotPasswordPage_sendEmailSuccessMsg
source: Password reset email sent. You are directed to the login page.
tr: Parola sıfırlama e-postası gönderildi. Giriş sayfasına yönlendiriliyorsunuz.

# forgotPasswordPage_sendMailErrorMsg
source: Failed to send password reset email! Please try again.
tr: Parola sıfırlama e-postası gönderilemedi! Lütfen yeniden deneyin.

# forgotPasswordPage_btnSend
source: Send
tr: Gönder

# scannerPage_title
source: Barcode Scanner
tr: Barkod Tarayıcısı

# scannerPage_cleanScannedListBtn
source: Clean
tr: Temizle

# scannerPage_emptyScannedList
source: Let's scan something!
tr: Bir şeyler tarayın!

# scannerPage_scannedData
source: Saved QR codes
tr: Taranan veri

# scannerPage_unkonwnBarcode
source: Unknown Barcode
tr: Tanımlanamayan barkod

# scannerPage_savedToListMsg
source: QR Code saved successfully!
tr: QR kodu listeye kaydedildi

# scannerPage_saveErrorMsg
source: Failed to save QR Code!
tr: QR kod kaydedilemedi!

# scannerErrorWidget_controllerUninitialized
source: Controller is not ready.
tr: Denetleyici hazır değil.

# scannerErrorWidget_permissionDenied
source: Permission denied
tr: İzin reddedildi

# scannerErrorWidget_unsupported
source: Browser does not support this device.
tr: Tarayıcı bu cihazda desteklenmiyor.

# scannerErrorWidget_unknown
source: Unknown Error. Please try again.
tr: Genel Hata. Lütfen tekrar deneyin.

# scannerPage_cameraStartError
source: Camera could not be started. Please try again.
tr: Kamera başlatılamadı. Lütfen tekrar deneyin.

# scannerPage_refreshBtnToolTip
source: Refresh Camera
tr: Kamerayı Yenile

# wrapper_LoginPageToolTip
source: Unexpected Error Occurred!
tr: Beklenmeyen Bir Hata oluştu!

# qrcodeDisplay_pageTitle
source: A a! Bir ÅŸeyler ters gitti...
tr: A a! Bir şeyler ters gitti...
